Revit 2027 API
DimensionSegment.IsTextPositionAdjustable Method
Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTextPositionAdjustable()
Public Function IsTextPositionAdjustable As Boolean
public:
bool IsTextPositionAdjustable()
member IsTextPositionAdjustable : unit -> bool
Return Value
Boolean
True if this dimension is supported to set/get TextPosition/LeaderPosition, false otherwise.
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace